validation/oneWayCoupledVdfTransportFoam/spray1D/monoModal_linear_coalescence/constant/quadratureProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      quadratureProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fieldMomentInversion basicVelocityFieldMomentInversion;


basicVelocityMomentInversion
{
    type sizeCHyQMOM;
    basicQuadrature
    {
        univariateMomentInversion   Gauss;
    }
}

momentAdvection
{
    velocityMomentAdvection   firstOrderKinetic;

    top
    {
        type noFlux;
    }
}

moments
(
    (0 0 0)
    (0 1 0)
    (0 0 1)
    (0 2 0)
    (0 1 1)
    (0 0 2)
    (0 3 0)
    (0 0 3)
    (0 4 0)
    (0 0 4)

    (1 0 0)
    (1 1 0)
    (1 0 1)
    (1 2 0)
    (1 1 1)
    (1 0 2)
    (1 3 0)
    (1 0 3)
    (1 4 0)
    (1 0 4)

    (2 0 0)
    (2 1 0)
    (2 0 1)
    (2 2 0)
    (2 1 1)
    (2 0 2)
    (2 3 0)
    (2 0 3)
    (2 4 0)
    (2 0 4)

    (3 0 0)
    (3 1 0)
    (3 0 1)
    (3 2 0)
    (3 1 1)
    (3 0 2)
    (3 3 0)
    (3 0 3)
    (3 4 0)
    (3 0 4)

    (4 0 0)
    (5 0 0)
    (6 0 0)
    (7 0 0)
);

nodes
(
    (0 0 0)
    (0 0 1)
    (0 0 2)
    (0 1 0)
    (0 1 1)
    (0 1 2)
    (0 2 0)
    (0 2 1)
    (0 2 2)

    (1 0 0)
    (1 0 1)
    (1 0 2)
    (1 1 0)
    (1 1 1)
    (1 1 2)
    (1 2 0)
    (1 2 1)
    (1 2 2)

    (2 0 0)
    (2 0 1)
    (2 0 2)
    (2 1 0)
    (2 1 1)
    (2 1 2)
    (2 2 0)
    (2 2 1)
    (2 2 2)

    (3 0 0)
    (3 0 1)
    (3 0 2)
    (3 1 0)
    (3 1 1)
    (3 1 2)
    (3 2 0)
    (3 2 1)
    (3 2 2)
);

// ************************************************************************* //
